import json

import pandas as pd
import pytest
from pandas import Timestamp

transactions = {
    'Дата операции': {0: '31.12.2021 16:44:00', 1: '31.12.2021 16:42:04', 2: '31.12.2021 16:39:04',
                      3: '31.12.2021 15:44:39', 4: '31.12.2021 01:23:42'},
    'Дата платежа': {0: '31.12.2021', 1: '31.12.2021', 2: '31.12.2021', 3: '31.12.2021', 4: '31.12.2021'},
    'Номер карты': {0: '*7197', 1: '*7197', 2: '*7197', 3: '*7197', 4: '*5091'},
    'Статус': {0: 'OK', 1: 'OK', 2: 'OK', 3: 'OK', 4: 'OK'},
    'Сумма операции': {0: -160.89, 1: -64.0, 2: -118.12, 3: -78.05, 4: -564.0},
    'Валюта операции': {0: 'RUB', 1: 'RUB', 2: 'RUB', 3: 'RUB', 4: 'RUB'},
    'Сумма платежа': {0: -160.89, 1: -64.0, 2: -118.12, 3: -78.05, 4: -564.0},
    'Валюта платежа': {0: 'RUB', 1: 'RUB', 2: 'RUB', 3: 'RUB', 4: 'RUB'},
    'Кэшбэк': {0: None, 1: None, 2: None, 3: None, 4: None},
    'Категория': {0: 'Супермаркеты', 1: 'Супермаркеты', 2: 'Супермаркеты', 3: 'Супермаркеты', 4: 'Различные товары'},
    'MCC': {0: 5411.0, 1: 5411.0, 2: 5411.0, 3: 5411.0, 4: 5399.0},
    'Описание': {0: 'Колхоз +7-920-000-00-00', 1: 'Колхоз 89200000000', 2: 'Магнит +7 910 00-00-00',
                 3: 'Колхоз 8(961)000-00-00', 4: 'Ozon.ru +7 901 111 11 11'},
    'Бонусы (включая кэшбэк)': {0: 3, 1: 1, 2: 2, 3: 1, 4: 5},
    'Округление на инвесткопилку': {0: 0, 1: 0, 2: 0, 3: 0, 4: 0},
    'Сумма операции с округлением': {0: 160.89, 1: 64.0, 2: 118.12, 3: 78.05, 4: 564.0}
}


@pytest.fixture
def utils_read_xlsx_data() -> pd.DataFrame:
    return pd.DataFrame(transactions)


@pytest.fixture
def utils_get_user_settings_data() -> str:
    return json.dumps(
        {
            "user_currencies": ["USD", "EUR"],
            "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]
        }
    )


@pytest.fixture
def reports_transactions() -> pd.DataFrame:
    data = {
        "Дата операции": [
            "24.08.2026 15:00:00",  # Понедельник
            "25.08.2026 16:00:00",  # Вторник
            "26.08.2026 17:00:00",  # Среда
            "27.08.2026 18:00:00",  # Четверг
            "28.08.2026 19:00:00",  # Пятница
            "29.08.2026 20:00:00",  # Суббота
            "30.08.2026 18:00:00",  # Воскресенье
        ],
        "Сумма платежа": [
            -100.50,
            -200.75,
            -50.25,
            -150.00,
            -300.00,
            -75.50,
            -125.25,
        ],
    }
    return pd.DataFrame(data)


@pytest.fixture
def reports_result() -> pd.DataFrame:
    data = [
        {'День недели': 'Monday', 'Cредние траты': -100.5},
        {'День недели': 'Tuesday', 'Cредние траты': -200.75},
        {'День недели': 'Wednesday', 'Cредние траты': -50.25},
        {'День недели': 'Thursday', 'Cредние траты': -150.0},
        {'День недели': 'Friday', 'Cредние траты': -300.0},
        {'День недели': 'Saturday', 'Cредние траты': -75.5},
        {'День недели': 'Sunday', 'Cредние траты': -125.25}
    ]
    return pd.DataFrame(data)


@pytest.fixture
def views_df() -> pd.DataFrame:
    data = [
        {'Дата операции': Timestamp('2021-12-20 22:14:18'), 'Дата платежа': '21.12.2021', 'Номер карты': '*7197',
         'Статус': 'OK', 'Сумма операции': -120.0, 'Валюта операции': 'RUB', 'Сумма платежа': -120.0,
         'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Фастфуд', 'MCC': 5814.0, 'Описание': 'ЛюдиЛюбят',
         'Бонусы (включая кэшбэк)': 2, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 120.0},
        {'Дата операции': Timestamp('2021-12-20 21:33:24'), 'Дата платежа': '21.12.2021', 'Номер карты': '*7197',
         'Статус': 'OK', 'Сумма операции': -1400.0, 'Валюта операции': 'RUB', 'Сумма платежа': -1400.0,
         'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Дом и ремонт', 'MCC': 7699.0, 'Описание': 'YM*o481',
         'Бонусы (включая кэшбэк)': 28, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 1400.0},
        {'Дата операции': Timestamp('2021-12-20 19:42:13'), 'Дата платежа': '20.12.2021', 'Номер карты': '*7197',
         'Статус': 'OK', 'Сумма операции': 421.0, 'Валюта операции': 'RUB', 'Сумма платежа': 421.0,
         'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Различные товары', 'MCC': 5399.0,
         'Описание': 'Ozon.ru', 'Бонусы (включая кэшбэк)': -8, 'Округление на инвесткопилку': 0,
         'Сумма операции с округлением': 421.0},
        {'Дата операции': Timestamp('2021-12-20 19:40:28'), 'Дата платежа': '20.12.2021', 'Номер карты': '*5091',
         'Статус': 'OK', 'Сумма операции': 232.96, 'Валюта операции': 'RUB', 'Сумма платежа': 232.96,
         'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Бонусы', 'MCC': None,
         'Описание': 'Выплата по вашему обращению', 'Бонусы (включая кэшбэк)': 0, 'Округление на инвесткопилку': 0,
         'Сумма операции с округлением': 232.96},
        {'Дата операции': Timestamp('2021-12-20 19:35:26'), 'Дата платежа': '20.12.2021', 'Номер карты': '*5091',
         'Статус': 'OK', 'Сумма операции': 495.0, 'Валюта операции': 'RUB', 'Сумма платежа': 495.0,
         'Валюта платежа': 'RUB', 'Кэшбэк': None, 'Категория': 'Бонусы', 'MCC': None,
         'Описание': 'Выплата по вашему обращению', 'Бонусы (включая кэшбэк)': 0, 'Округление на инвесткопилку': 0,
         'Сумма операции с округлением': 495.0}
    ]
    return pd.DataFrame(data)


@pytest.fixture
def views_get_cards_list() -> list:
    return [{"last_digits": "7197", "total_spent": 1520.0, "cashback": 15.2}]


@pytest.fixture
def views_get_top_transactions_list() -> list:
    return [
        {'date': '20.12.2021', 'amount': 495.0, 'category': 'Бонусы', 'description': 'Выплата по вашему обращению'},
        {'date': '20.12.2021', 'amount': 421.0, 'category': 'Различные товары', 'description': 'Ozon.ru'},
        {'date': '20.12.2021', 'amount': 232.96, 'category': 'Бонусы', 'description': 'Выплата по вашему обращению'},
        {'date': '20.12.2021', 'amount': -120.0, 'category': 'Фастфуд', 'description': 'ЛюдиЛюбят'},
        {'date': '20.12.2021', 'amount': -1400.0, 'category': 'Дом и ремонт', 'description': 'YM*o481'}
    ]


@pytest.fixture
def views_user_settings() -> dict[str, list[str]]:
    return {
        "user_currencies": ["USD", "EUR", "GBP"],
        "user_stocks": ["AAPL"]
    }


@pytest.fixture
def views_currency_response() -> dict:
    return {
        "data": {
            "USDRUB": "73.4567",
            "EURRUB": "85.1234",
            "GBPRUB": "95.6789"
        }
    }


@pytest.fixture
def views_currency_result() -> list[dict]:
    return [
        {"currency": "USD", "rate": 73.46},
        {"currency": "EUR", "rate": 85.12},
        {"currency": "GBP", "rate": 95.68}
    ]


@pytest.fixture
def views_stock_response() -> dict:
    return {
            "ticker": "AAPL",
            "price": 319.7
    }


@pytest.fixture
def views_stock_result() -> list[dict]:
    return [
        {
            "stock": "AAPL",
            "price": 319.7
        }
    ]


@pytest.fixture
def process_data_result() -> str:
    result = {
                "greeting": "Доброе утро",
                "cards": [
                    {
                        "last_digits": "5091",
                        "total_spent": 564.0,
                        "cashback": 5.64
                    },
                    {
                        "last_digits": "7197",
                        "total_spent": 421.06,
                        "cashback": 4.21
                    }
                ],
                "top_transactions": [
                    {
                        "date": "31.12.2021",
                        "amount": -64.0,
                        "category": "Супермаркеты",
                        "description": "Колхоз 89200000000"
                    },
                    {
                        "date": "31.12.2021",
                        "amount": -78.05,
                        "category": "Супермаркеты",
                        "description": "Колхоз 8(961)000-00-00"
                    },
                    {
                        "date": "31.12.2021",
                        "amount": -118.12,
                        "category": "Супермаркеты",
                        "description": "Магнит +7 910 00-00-00"
                    },
                    {
                        "date": "31.12.2021",
                        "amount": -160.89,
                        "category": "Супермаркеты",
                        "description": "Колхоз +7-920-000-00-00"
                    },
                    {
                        "date": "31.12.2021",
                        "amount": -564.0,
                        "category": "Различные товары",
                        "description": "Ozon.ru +7 901 111 11 11"
                    }
                ],
                "currency_rates": [
                    {
                        "currency": "USD",
                        "rate": 73.46
                    },
                    {
                        "currency": "EUR",
                        "rate": 85.12
                    },
                    {
                        "currency": "GBP",
                        "rate": 95.68
                    }
                ],
                "stock_prices": [
                    {
                        "stock": "AAPL",
                        "price": 319.7
                    }
                ]
    }
    return json.dumps(result, ensure_ascii=False, indent=4)
