import json

import pandas as pd
import pytest

transactions = {
    'Дата операции': {0: '31.12.2021 16:44:00', 1: '31.12.2021 16:42:04', 2: '31.12.2021 16:39:04',
                      3: '31.12.2021 15:44:39', 4: '31.12.2021 01:23:42'},
    'Дата платежа': {0: '31.12.2021', 1: '31.12.2021', 2: '31.12.2021', 3: '31.12.2021', 4: '31.12.2021'},
    'Номер карты': {0: '*7197', 1: '*7197', 2: '*7197', 3: '*7197', 4: '*5091'},
    'Статус': {0: 'OK', 1: 'OK', 2: 'OK', 3: 'OK', 4: 'OK'},
    'Сумма операции': {0: -160.89, 1: -64.0, 2: -118.12, 3: -78.05, 4: -564.0},
    'Валюта операции': {0: 'RUB', 1: 'RUB', 2: 'RUB', 3: 'RUB', 4: 'RUB'},
    'Сумма платежа': {0: -160.89, 1: -64.0, 2: -118.12, 3: -78.05, 4: -564.0},
    'Валюта платежа': {0: 'RUB', 1: 'RUB', 2: 'RUB', 3: 'RUB', 4: 'RUB'},
    'Кэшбэк': {0: None, 1: None, 2: None, 3: None, 4: None},
    'Категория': {0: 'Супермаркеты', 1: 'Супермаркеты', 2: 'Супермаркеты', 3: 'Супермаркеты', 4: 'Различные товары'},
    'MCC': {0: 5411.0, 1: 5411.0, 2: 5411.0, 3: 5411.0, 4: 5399.0},
    'Описание': {0: 'Колхоз +7-920-000-00-00', 1: 'Колхоз 89200000000', 2: 'Магнит +7 910 00-00-00',
                 3: 'Колхоз 8(961)000-00-00', 4: 'Ozon.ru +7 901 111 11 11'},
    'Бонусы (включая кэшбэк)': {0: 3, 1: 1, 2: 2, 3: 1, 4: 5},
    'Округление на инвесткопилку': {0: 0, 1: 0, 2: 0, 3: 0, 4: 0},
    'Сумма операции с округлением': {0: 160.89, 1: 64.0, 2: 118.12, 3: 78.05, 4: 564.0}
}


@pytest.fixture
def utils_read_xlsx_data() -> pd.DataFrame:
    return pd.DataFrame(transactions)


@pytest.fixture
def utils_get_user_settings_data() -> str:
    return json.dumps(
        {
            "user_currencies": ["USD", "EUR"],
            "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]
        }
    )


@pytest.fixture
def services_find_phone_numbers(utils_read_xlsx_data: pd.DataFrame) -> str:
    return json.dumps(transactions, ensure_ascii=False)
#     return """[
#     {
#         "Дата операции": "31.12.2021 16:44:00",
#         "Дата платежа": "31.12.2021",
#         "Номер карты": "*7197",
#         "Статус": "OK",
#         "Сумма операции": -160.89,
#         "Валюта операции": "RUB",
#         "Сумма платежа": -160.89,
#         "Валюта платежа": "RUB",
#         "Кэшбэк": null,
#         "Категория": "Супермаркеты",
#         "MCC": 5411.0,
#         "Описание": "Колхоз +7-920-000-00-00",
#         "Бонусы (включая кэшбэк)": 3,
#         "Округление на инвесткопилку": 0,
#         "Сумма операции с округлением": 160.89
#     },
#     {
#         "Дата операции": "31.12.2021 16:42:04",
#         "Дата платежа": "31.12.2021",
#         "Номер карты": "*7197",
#         "Статус": "OK",
#         "Сумма операции": -64.0,
#         "Валюта операции": "RUB",
#         "Сумма платежа": -64.0,
#         "Валюта платежа": "RUB",
#         "Кэшбэк": null,
#         "Категория": "Супермаркеты",
#         "MCC": 5411.0,
#         "Описание": "Колхоз 89200000000",
#         "Бонусы (включая кэшбэк)": 1,
#         "Округление на инвесткопилку": 0,
#         "Сумма операции с округлением": 64.0
#     },
#     {
#         "Дата операции": "31.12.2021 15:44:39",
#         "Дата платежа": "31.12.2021",
#         "Номер карты": "*7197",
#         "Статус": "OK",
#         "Сумма операции": -78.05,
#         "Валюта операции": "RUB",
#         "Сумма платежа": -78.05,
#         "Валюта платежа": "RUB",
#         "Кэшбэк": null,
#         "Категория": "Супермаркеты",
#         "MCC": 5411.0,
#         "Описание": "Колхоз 8(961)000-00-00",
#         "Бонусы (включая кэшбэк)": 1,
#         "Округление на инвесткопилку": 0,
#         "Сумма операции с округлением": 78.05
#     },
#     {
#         "Дата операции": "31.12.2021 01:23:42",
#         "Дата платежа": "31.12.2021",
#         "Номер карты": "*5091",
#         "Статус": "OK",
#         "Сумма операции": -564.0,
#         "Валюта операции": "RUB",
#         "Сумма платежа": -564.0,
#         "Валюта платежа": "RUB",
#         "Кэшбэк": null,
#         "Категория": "Различные товары",
#         "MCC": 5399.0,
#         "Описание": "Ozon.ru +7 901 111 11 11",
#         "Бонусы (включая кэшбэк)": 5,
#         "Округление на инвесткопилку": 0,
#         "Сумма операции с округлением": 564.0
#     }
# ]"""